In [2]:
import pandas as pd

In [31]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]
       ,'Age':[23,45,91,10,33,30]}

In [32]:
df = pd.DataFrame(data)

In [33]:
df

   Age Company   Person  Sales
0   23    GOOG      Sam    200
1   45    GOOG  Charlie    120
2   91    MSFT      Amy    340
3   10    MSFT  Vanessa    124
4   33      FB     Carl    243
5   30      FB    Sarah    350

In [34]:
by_company = df.groupby('Company')

In [35]:
by_company.mean()

          Age  Sales
Company
FB       31.5  296.5
GOOG     34.0  160.0
MSFT     50.5  232.0

In [36]:
df.groupby('Company').count()

         Age  Person  Sales
Company
FB         2       2      2
GOOG       2       2      2
MSFT       2       2      2

In [37]:
df.groupby('Company').max()

         Age   Person  Sales
Company
FB        33    Sarah    350
GOOG      45      Sam    200
MSFT      91  Vanessa    340

In [39]:
df.groupby('Company').describe().T

Company              FB        GOOG        MSFT
Age   count    2.000000    2.000000    2.000000
      mean    31.500000   34.000000   50.500000
      std      2.121320   15.556349   57.275649
      min     30.000000   23.000000   10.000000
      25%     30.750000   28.500000   30.250000
      50%     31.500000   34.000000   50.500000
      75%     32.250000   39.500000   70.750000
      max     33.000000   45.000000   91.000000
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [40]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [50]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [51]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [59]:
df = pd.read_csv('example')

In [60]:
#df.to_csv('My_output', index=False)

In [62]:
pd.read_excel('Excel_Sample.xlsx', sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [63]:
#df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [65]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [71]:
type(data)

list

In [75]:
data[0].head(3)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"

In [76]:
from sqlalchemy import create_engine

In [79]:
engine = create_engine('sqlite:///:memory:')

In [80]:
df.to_sql('my_table', engine)

In [81]:
sql_df = pd.read_sql('my_table', con=engine)

In [82]:
sql_df.head(3)

   index  a  b   c   d
0      0  0  1   2   3
1      1  4  5   6   7
2      2  8  9  10  11